=========
#commands
=========

#check "foo"
#eval 37
#reduce 73
#print inferInstance

---

(module
  (interactive (string))
  (interactive (number))
  (interactive (number))
  (interactive (identifier)))

===================
Same Line #commands
===================

#eval id 2 #eval 5

---

(module
  (interactive (apply (identifier) (number)))
  (interactive (number)))

==============
#check_failure
==============

#check_failure (inferInstance : Inhabited (Nat Ã— _))

---

(module
  (interactive
    (parenthesized
      (identifier)
      (type_ascription
        type:
          (apply
            name: (identifier)
            arguments:
              (parenthesized (product (identifier) (hole))))))))

=======
Prelude
=======

prelude
import Foo

---

(module
  (prelude)
  (import
    module: (identifier)))

====
Open
====

open Foo
open Foo.Bar
open Foo Bar Baz.Quux

---

(module
  (open
    namespace: (identifier))
  (open
    namespace: (identifier))
  (open
    namespace: (identifier)
    namespace: (identifier)
    namespace: (identifier)))

=========
Open Only
=========

open Foo (bar baz)

---

(module
  (open
    namespace: (identifier)
    only: (identifier)
    only: (identifier)))

===========
Open Scoped
===========

open scoped Foo
open scoped Bar Baz

---

(module
  (open
    scoped: (identifier))
  (open
    scoped: (identifier)
    scoped: (identifier)))

=======
Open In
=======

open Foo in
  def baz := bar

---

(module
  (scoped_in
    (open
      namespace: (identifier))
    (def
      name: (identifier)
      body: (identifier))))

======================
Open With Missing Name
======================

open

---

(module (ERROR))

======
Import
======

import Foo

---

(module
  (import
    module: (identifier)))

=============
Import Nested
=============

import Foo.Bar.Baz

---

(module
  (import
    module: (identifier)))

========================
Import With Missing Name
========================

import

---

(module (ERROR))

======
Export
======

export Foo (bar baz)

---

(module
  (export
    class: (identifier)
    (identifier)
    (identifier)))

============
Empty Export
============

export Foo ()

---

(module (export (identifier) (identifier (MISSING _identifier))))

========================
Export With Missing Name
========================

export

---

(module (ERROR))

========
Universe
========

universe t
universe u2 v2 w2

---

(module
  (universe (identifier))
  (universe (identifier) (identifier) (identifier)))

==========================
Universe With Missing Name
==========================

universe

---

(module (ERROR))

=========
Universes
=========

universes u2 v2 w2

---

(module (ERROR))

===============
Quoted Commands
===============

def f : Lean.Elab.Command.CommandElabM Lean.Syntax :=
`(
    namespace bar
    def bar := 12
    end bar
  )

---

(module
  (def (identifier) (apply (identifier) (identifier))
    (quoted
      (namespace (identifier)
        (def (identifier) (number))
        (identifier))))))
