======
String
======

#eval "foo"
#eval "'"

---

(module (interactive (string)) (interactive (string)))

============
Empty String
============

#eval ""

---

(module (interactive (string)))

================
Escape Sequences
================

#eval "f\'o\"\ro\nb\ta\\r"

---

(module
  (interactive
    (string
      (quotedChar)
      (quotedChar)
      (quotedChar)
      (quotedChar)
      (quotedChar)
      (quotedChar))))

=========
\x and \u
=========

#eval "\x12\u1234"

---

(module
  (interactive
    (string
      (quotedChar)
      (quotedChar))))

====
Char
====

#eval 'f'
#eval '"'

---

(module (interactive (char)) (interactive (char)))

====================
Char Escape Sequence
====================

#eval '\''

---

(module (interactive (char (quotedChar))))

========
Non-Char
========

#eval 'fa'

---

(module (interactive (ERROR) (identifier)))

==================================
Non-Interpolation in Normal String
==================================

#eval println! "The result of squaring the integer 4573 and adding 3 is {result1}"

---

(module (interactive (apply (identifier) (string))))

=============
Interpolation
=============

#eval println! s!"The result of squaring the integer 4573 and adding 3 is {result1}"

---

(module
  (interactive
    (apply (identifier)
      (interpolatedString (interpolation (identifier))))))

=======================================
Interpolation With Function Application
=======================================

#eval println! s!"The result of applying sampleFunction3 to 2 is {sampleFunction3 2}"

---

(module
  (interactive
    (apply (identifier)
      (interpolatedString
        (interpolation (apply (identifier) (number)))))))

===================================
Interpolation With Escape Sequences
===================================

#eval s!"f\'o\"\ro\nb\ta\\r {baz}"

---

(module
  (interactive
    (interpolatedString
      (quotedChar)
      (quotedChar)
      (quotedChar)
      (quotedChar)
      (quotedChar)
      (quotedChar)
      (interpolation (identifier)))))

==============
String With --
==============

#eval "--"
#eval "/--"

---

(module
  (interactive (string))
  (interactive (string)))
